Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA310.h
#define _CNPU4_CN48PUE_POSITION                  0x00000000
#define _CNPU4_CN48PUE_MASK                      0x00000001
#define _CNPU4_CN48PUE_LENGTH                    0x00000001

#define _CNPU4_CN49PUE_POSITION                  0x00000001
#define _CNPU4_CN49PUE_MASK                      0x00000002
#define _CNPU4_CN49PUE_LENGTH                    0x00000001

#define _CNPU4_CN50PUE_POSITION                  0x00000002
#define _CNPU4_CN50PUE_MASK                      0x00000004
#define _CNPU4_CN50PUE_LENGTH                    0x00000001

#define _CNPU4_CN51PUE_POSITION                  0x00000003
#define _CNPU4_CN51PUE_MASK                      0x00000008
#define _CNPU4_CN51PUE_LENGTH                    0x00000001

#define _CNPU4_CN52PUE_POSITION                  0x00000004
#define _CNPU4_CN52PUE_MASK                      0x00000010
#define _CNPU4_CN52PUE_LENGTH                    0x00000001

#define _CNPU4_CN53PUE_POSITION                  0x00000005
#define _CNPU4_CN53PUE_MASK                      0x00000020
#define _CNPU4_CN53PUE_LENGTH                    0x00000001

#define _CNPU4_CN54PUE_POSITION                  0x00000006
#define _CNPU4_CN54PUE_MASK                      0x00000040
#define _CNPU4_CN54PUE_LENGTH                    0x00000001

#define _CNPU4_CN55PUE_POSITION                  0x00000007
#define _CNPU4_CN55PUE_MASK                      0x00000080
#define _CNPU4_CN55PUE_LENGTH                    0x00000001

#define _CNPU4_CN56PUE_POSITION                  0x00000008
#define _CNPU4_CN56PUE_MASK                      0x00000100
#define _CNPU4_CN56PUE_LENGTH                    0x00000001

#define _CNPU4_CN57PUE_POSITION                  0x00000009
#define _CNPU4_CN57PUE_MASK                      0x00000200
#define _CNPU4_CN57PUE_LENGTH                    0x00000001

#define _CNPU4_CN58PUE_POSITION                  0x0000000A
#define _CNPU4_CN58PUE_MASK                      0x00000400
#define _CNPU4_CN58PUE_LENGTH                    0x00000001

#define _CNPU4_CN59PUE_POSITION                  0x0000000B
#define _CNPU4_CN59PUE_MASK                      0x00000800
#define _CNPU4_CN59PUE_LENGTH                    0x00000001

#define _CNPU4_CN60PUE_POSITION                  0x0000000C
#define _CNPU4_CN60PUE_MASK                      0x00001000
#define _CNPU4_CN60PUE_LENGTH                    0x00000001

#define _CNPU4_CN61PUE_POSITION                  0x0000000D
#define _CNPU4_CN61PUE_MASK                      0x00002000
#define _CNPU4_CN61PUE_LENGTH                    0x00000001

#define _CNPU4_CN62PUE_POSITION                  0x0000000E
#define _CNPU4_CN62PUE_MASK                      0x00004000
#define _CNPU4_CN62PUE_LENGTH                    0x00000001

#define _CNPU4_CN63PUE_POSITION                  0x0000000F
#define _CNPU4_CN63PUE_MASK                      0x00008000
#define _CNPU4_CN63PUE_LENGTH                    0x00000001

#define _CNPU5_CN64PUE_POSITION                  0x00000000
#define _CNPU5_CN64PUE_MASK                      0x00000001
#define _CNPU5_CN64PUE_LENGTH                    0x00000001

#define _CNPU5_CN65PUE_POSITION                  0x00000001
#define _CNPU5_CN65PUE_MASK                      0x00000002
#define _CNPU5_CN65PUE_LENGTH                    0x00000001

#define _CNPU5_CN66PUE_POSITION                  0x00000002
#define _CNPU5_CN66PUE_MASK                      0x00000004
#define _CNPU5_CN66PUE_LENGTH                    0x00000001

#define _CNPU5_CN67PUE_POSITION                  0x00000003
#define _CNPU5_CN67PUE_MASK                      0x00000008
#define _CNPU5_CN67PUE_LENGTH                    0x00000001

#define _CNPU5_CN68PUE_POSITION                  0x00000004
#define _CNPU5_CN68PUE_MASK                      0x00000010
#define _CNPU5_CN68PUE_LENGTH                    0x00000001

#define _CNPU5_CN69PUE_POSITION                  0x00000005
#define _CNPU5_CN69PUE_MASK                      0x00000020
#define _CNPU5_CN69PUE_LENGTH                    0x00000001

#define _CNPU5_CN70PUE_POSITION                  0x00000006
#define _CNPU5_CN70PUE_MASK                      0x00000040
#define _CNPU5_CN70PUE_LENGTH                    0x00000001

#define _CNPU5_CN71PUE_POSITION                  0x00000007
#define _CNPU5_CN71PUE_MASK                      0x00000080
#define _CNPU5_CN71PUE_LENGTH                    0x00000001

#define _CNPU5_CN72PUE_POSITION                  0x00000008
#define _CNPU5_CN72PUE_MASK                      0x00000100
#define _CNPU5_CN72PUE_LENGTH                    0x00000001

#define _CNPU5_CN73PUE_POSITION                  0x00000009
#define _CNPU5_CN73PUE_MASK                      0x00000200
#define _CNPU5_CN73PUE_LENGTH                    0x00000001

#define _CNPU5_CN74PUE_POSITION                  0x0000000A
#define _CNPU5_CN74PUE_MASK                      0x00000400
#define _CNPU5_CN74PUE_LENGTH                    0x00000001

#define _CNPU5_CN75PUE_POSITION                  0x0000000B
#define _CNPU5_CN75PUE_MASK                      0x00000800
#define _CNPU5_CN75PUE_LENGTH                    0x00000001

#define _CNPU5_CN76PUE_POSITION                  0x0000000C
#define _CNPU5_CN76PUE_MASK                      0x00001000
#define _CNPU5_CN76PUE_LENGTH                    0x00000001

#define _CNPU5_CN77PUE_POSITION                  0x0000000D
#define _CNPU5_CN77PUE_MASK                      0x00002000
#define _CNPU5_CN77PUE_LENGTH                    0x00000001

#define _CNPU5_CN78PUE_POSITION                  0x0000000E
#define _CNPU5_CN78PUE_MASK                      0x00004000
#define _CNPU5_CN78PUE_LENGTH                    0x00000001

#define _CNPU5_CN79PUE_POSITION                  0x0000000F
#define _CNPU5_CN79PUE_MASK                      0x00008000
#define _CNPU5_CN79PUE_LENGTH                    0x00000001

#define _CNPU6_CN80PUE_POSITION                  0x00000000
#define _CNPU6_CN80PUE_MASK                      0x00000001
#define _CNPU6_CN80PUE_LENGTH                    0x00000001

#define _CNPU6_CN81PUE_POSITION                  0x00000001
#define _CNPU6_CN81PUE_MASK                      0x00000002
#define _CNPU6_CN81PUE_LENGTH                    0x00000001

#define _CNPU6_CN82PUE_POSITION                  0x00000002
#define _CNPU6_CN82PUE_MASK                      0x00000004
#define _CNPU6_CN82PUE_LENGTH                    0x00000001

#define _CNPU6_CN83PUE_POSITION                  0x00000003
#define _CNPU6_CN83PUE_MASK                      0x00000008
#define _CNPU6_CN83PUE_LENGTH                    0x00000001

#define _CNPU6_CN84PUE_POSITION                  0x00000004
#define _CNPU6_CN84PUE_MASK                      0x00000010
#define _CNPU6_CN84PUE_LENGTH                    0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_NSTDIS_POSITION                 0x0000000F
#define _INTCON1_NSTDIS_MASK                     0x00008000
#define _INTCON1_NSTDIS_LENGTH                   0x00000001

