Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA310.h
#define _LCDSE0_SE05_POSITION                    0x00000005
#define _LCDSE0_SE05_MASK                        0x00000020
#define _LCDSE0_SE05_LENGTH                      0x00000001

#define _LCDSE0_SE06_POSITION                    0x00000006
#define _LCDSE0_SE06_MASK                        0x00000040
#define _LCDSE0_SE06_LENGTH                      0x00000001

#define _LCDSE0_SE07_POSITION                    0x00000007
#define _LCDSE0_SE07_MASK                        0x00000080
#define _LCDSE0_SE07_LENGTH                      0x00000001

#define _LCDSE0_SE08_POSITION                    0x00000008
#define _LCDSE0_SE08_MASK                        0x00000100
#define _LCDSE0_SE08_LENGTH                      0x00000001

#define _LCDSE0_SE09_POSITION                    0x00000009
#define _LCDSE0_SE09_MASK                        0x00000200
#define _LCDSE0_SE09_LENGTH                      0x00000001

#define _LCDSE0_SE10_POSITION                    0x0000000A
#define _LCDSE0_SE10_MASK                        0x00000400
#define _LCDSE0_SE10_LENGTH                      0x00000001

#define _LCDSE0_SE11_POSITION                    0x0000000B
#define _LCDSE0_SE11_MASK                        0x00000800
#define _LCDSE0_SE11_LENGTH                      0x00000001

#define _LCDSE0_SE12_POSITION                    0x0000000C
#define _LCDSE0_SE12_MASK                        0x00001000
#define _LCDSE0_SE12_LENGTH                      0x00000001

#define _LCDSE0_SE13_POSITION                    0x0000000D
#define _LCDSE0_SE13_MASK                        0x00002000
#define _LCDSE0_SE13_LENGTH                      0x00000001

#define _LCDSE0_SE14_POSITION                    0x0000000E
#define _LCDSE0_SE14_MASK                        0x00004000
#define _LCDSE0_SE14_LENGTH                      0x00000001

#define _LCDSE0_SE15_POSITION                    0x0000000F
#define _LCDSE0_SE15_MASK                        0x00008000
#define _LCDSE0_SE15_LENGTH                      0x00000001

#define _LCDSE1_SE16_POSITION                    0x00000000
#define _LCDSE1_SE16_MASK                        0x00000001
#define _LCDSE1_SE16_LENGTH                      0x00000001

#define _LCDSE1_SE17_POSITION                    0x00000001
#define _LCDSE1_SE17_MASK                        0x00000002
#define _LCDSE1_SE17_LENGTH                      0x00000001

#define _LCDSE1_SE18_POSITION                    0x00000002
#define _LCDSE1_SE18_MASK                        0x00000004
#define _LCDSE1_SE18_LENGTH                      0x00000001

#define _LCDSE1_SE19_POSITION                    0x00000003
#define _LCDSE1_SE19_MASK                        0x00000008
#define _LCDSE1_SE19_LENGTH                      0x00000001

#define _LCDSE1_SE20_POSITION                    0x00000004
#define _LCDSE1_SE20_MASK                        0x00000010
#define _LCDSE1_SE20_LENGTH                      0x00000001

#define _LCDSE1_SE21_POSITION                    0x00000005
#define _LCDSE1_SE21_MASK                        0x00000020
#define _LCDSE1_SE21_LENGTH                      0x00000001

#define _LCDSE1_SE22_POSITION                    0x00000006
#define _LCDSE1_SE22_MASK                        0x00000040
#define _LCDSE1_SE22_LENGTH                      0x00000001

#define _LCDSE1_SE23_POSITION                    0x00000007
#define _LCDSE1_SE23_MASK                        0x00000080
#define _LCDSE1_SE23_LENGTH                      0x00000001

#define _LCDSE1_SE24_POSITION                    0x00000008
#define _LCDSE1_SE24_MASK                        0x00000100
#define _LCDSE1_SE24_LENGTH                      0x00000001

#define _LCDSE1_SE25_POSITION                    0x00000009
#define _LCDSE1_SE25_MASK                        0x00000200
#define _LCDSE1_SE25_LENGTH                      0x00000001

#define _LCDSE1_SE26_POSITION                    0x0000000A
#define _LCDSE1_SE26_MASK                        0x00000400
#define _LCDSE1_SE26_LENGTH                      0x00000001

#define _LCDSE1_SE27_POSITION                    0x0000000B
#define _LCDSE1_SE27_MASK                        0x00000800
#define _LCDSE1_SE27_LENGTH                      0x00000001

#define _LCDSE1_SE28_POSITION                    0x0000000C
#define _LCDSE1_SE28_MASK                        0x00001000
#define _LCDSE1_SE28_LENGTH                      0x00000001

#define _LCDSE1_SE29_POSITION                    0x0000000D
#define _LCDSE1_SE29_MASK                        0x00002000
#define _LCDSE1_SE29_LENGTH                      0x00000001

#define _LCDSE1_SE30_POSITION                    0x0000000E
#define _LCDSE1_SE30_MASK                        0x00004000
#define _LCDSE1_SE30_LENGTH                      0x00000001

#define _LCDSE1_SE31_POSITION                    0x0000000F
#define _LCDSE1_SE31_MASK                        0x00008000
#define _LCDSE1_SE31_LENGTH                      0x00000001

#define _LCDSE2_SE32_POSITION                    0x00000000
#define _LCDSE2_SE32_MASK                        0x00000001
#define _LCDSE2_SE32_LENGTH                      0x00000001

#define _LCDSE2_SE33_POSITION                    0x00000001
#define _LCDSE2_SE33_MASK                        0x00000002
#define _LCDSE2_SE33_LENGTH                      0x00000001

#define _LCDSE2_SE34_POSITION                    0x00000002
#define _LCDSE2_SE34_MASK                        0x00000004
#define _LCDSE2_SE34_LENGTH                      0x00000001

#define _LCDSE2_SE35_POSITION                    0x00000003
#define _LCDSE2_SE35_MASK                        0x00000008
#define _LCDSE2_SE35_LENGTH                      0x00000001

#define _LCDSE2_SE36_POSITION                    0x00000004
#define _LCDSE2_SE36_MASK                        0x00000010
#define _LCDSE2_SE36_LENGTH                      0x00000001

#define _LCDSE2_SE37_POSITION                    0x00000005
#define _LCDSE2_SE37_MASK                        0x00000020
#define _LCDSE2_SE37_LENGTH                      0x00000001

#define _LCDSE2_SE38_POSITION                    0x00000006
#define _LCDSE2_SE38_MASK                        0x00000040
#define _LCDSE2_SE38_LENGTH                      0x00000001

#define _LCDSE2_SE39_POSITION                    0x00000007
#define _LCDSE2_SE39_MASK                        0x00000080
#define _LCDSE2_SE39_LENGTH                      0x00000001

#define _LCDSE2_SE40_POSITION                    0x00000008
#define _LCDSE2_SE40_MASK                        0x00000100
#define _LCDSE2_SE40_LENGTH                      0x00000001

#define _LCDSE2_SE41_POSITION                    0x00000009
#define _LCDSE2_SE41_MASK                        0x00000200
#define _LCDSE2_SE41_LENGTH                      0x00000001

#define _LCDSE2_SE42_POSITION                    0x0000000A
#define _LCDSE2_SE42_MASK                        0x00000400
#define _LCDSE2_SE42_LENGTH                      0x00000001

