Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ64GA310.h
#define _LCDDATA5_S19C1_POSITION                 0x00000003
#define _LCDDATA5_S19C1_MASK                     0x00000008
#define _LCDDATA5_S19C1_LENGTH                   0x00000001

#define _LCDDATA5_S20C1_POSITION                 0x00000004
#define _LCDDATA5_S20C1_MASK                     0x00000010
#define _LCDDATA5_S20C1_LENGTH                   0x00000001

#define _LCDDATA5_S21C1_POSITION                 0x00000005
#define _LCDDATA5_S21C1_MASK                     0x00000020
#define _LCDDATA5_S21C1_LENGTH                   0x00000001

#define _LCDDATA5_S22C1_POSITION                 0x00000006
#define _LCDDATA5_S22C1_MASK                     0x00000040
#define _LCDDATA5_S22C1_LENGTH                   0x00000001

#define _LCDDATA5_S23C1_POSITION                 0x00000007
#define _LCDDATA5_S23C1_MASK                     0x00000080
#define _LCDDATA5_S23C1_LENGTH                   0x00000001

#define _LCDDATA5_S24C1_POSITION                 0x00000008
#define _LCDDATA5_S24C1_MASK                     0x00000100
#define _LCDDATA5_S24C1_LENGTH                   0x00000001

#define _LCDDATA5_S25C1_POSITION                 0x00000009
#define _LCDDATA5_S25C1_MASK                     0x00000200
#define _LCDDATA5_S25C1_LENGTH                   0x00000001

#define _LCDDATA5_S26C1_POSITION                 0x0000000A
#define _LCDDATA5_S26C1_MASK                     0x00000400
#define _LCDDATA5_S26C1_LENGTH                   0x00000001

#define _LCDDATA5_S27C1_POSITION                 0x0000000B
#define _LCDDATA5_S27C1_MASK                     0x00000800
#define _LCDDATA5_S27C1_LENGTH                   0x00000001

#define _LCDDATA5_S28C1_POSITION                 0x0000000C
#define _LCDDATA5_S28C1_MASK                     0x00001000
#define _LCDDATA5_S28C1_LENGTH                   0x00000001

#define _LCDDATA5_S29C1_POSITION                 0x0000000D
#define _LCDDATA5_S29C1_MASK                     0x00002000
#define _LCDDATA5_S29C1_LENGTH                   0x00000001

#define _LCDDATA5_S30C1_POSITION                 0x0000000E
#define _LCDDATA5_S30C1_MASK                     0x00004000
#define _LCDDATA5_S30C1_LENGTH                   0x00000001

#define _LCDDATA5_S31C1_POSITION                 0x0000000F
#define _LCDDATA5_S31C1_MASK                     0x00008000
#define _LCDDATA5_S31C1_LENGTH                   0x00000001

#define _LCDDATA6_S32C1_POSITION                 0x00000000
#define _LCDDATA6_S32C1_MASK                     0x00000001
#define _LCDDATA6_S32C1_LENGTH                   0x00000001

#define _LCDDATA6_S33C1_POSITION                 0x00000001
#define _LCDDATA6_S33C1_MASK                     0x00000002
#define _LCDDATA6_S33C1_LENGTH                   0x00000001

#define _LCDDATA6_S34C1_POSITION                 0x00000002
#define _LCDDATA6_S34C1_MASK                     0x00000004
#define _LCDDATA6_S34C1_LENGTH                   0x00000001

#define _LCDDATA6_S35C1_POSITION                 0x00000003
#define _LCDDATA6_S35C1_MASK                     0x00000008
#define _LCDDATA6_S35C1_LENGTH                   0x00000001

#define _LCDDATA6_S36C1_POSITION                 0x00000004
#define _LCDDATA6_S36C1_MASK                     0x00000010
#define _LCDDATA6_S36C1_LENGTH                   0x00000001

#define _LCDDATA6_S37C1_POSITION                 0x00000005
#define _LCDDATA6_S37C1_MASK                     0x00000020
#define _LCDDATA6_S37C1_LENGTH                   0x00000001

#define _LCDDATA6_S38C1_POSITION                 0x00000006
#define _LCDDATA6_S38C1_MASK                     0x00000040
#define _LCDDATA6_S38C1_LENGTH                   0x00000001

#define _LCDDATA6_S39C1_POSITION                 0x00000007
#define _LCDDATA6_S39C1_MASK                     0x00000080
#define _LCDDATA6_S39C1_LENGTH                   0x00000001

#define _LCDDATA6_S40C1_POSITION                 0x00000008
#define _LCDDATA6_S40C1_MASK                     0x00000100
#define _LCDDATA6_S40C1_LENGTH                   0x00000001

#define _LCDDATA6_S41C1_POSITION                 0x00000009
#define _LCDDATA6_S41C1_MASK                     0x00000200
#define _LCDDATA6_S41C1_LENGTH                   0x00000001

#define _LCDDATA6_S42C1_POSITION                 0x0000000A
#define _LCDDATA6_S42C1_MASK                     0x00000400
#define _LCDDATA6_S42C1_LENGTH                   0x00000001

#define _LCDDATA6_S43C1_POSITION                 0x0000000B
#define _LCDDATA6_S43C1_MASK                     0x00000800
#define _LCDDATA6_S43C1_LENGTH                   0x00000001

#define _LCDDATA6_S44C1_POSITION                 0x0000000C
#define _LCDDATA6_S44C1_MASK                     0x00001000
#define _LCDDATA6_S44C1_LENGTH                   0x00000001

#define _LCDDATA6_S45C1_POSITION                 0x0000000D
#define _LCDDATA6_S45C1_MASK                     0x00002000
#define _LCDDATA6_S45C1_LENGTH                   0x00000001

#define _LCDDATA6_S46C1_POSITION                 0x0000000E
#define _LCDDATA6_S46C1_MASK                     0x00004000
#define _LCDDATA6_S46C1_LENGTH                   0x00000001

#define _LCDDATA6_S47C1_POSITION                 0x0000000F
#define _LCDDATA6_S47C1_MASK                     0x00008000
#define _LCDDATA6_S47C1_LENGTH                   0x00000001

#define _LCDDATA7_S48C1_POSITION                 0x00000000
#define _LCDDATA7_S48C1_MASK                     0x00000001
#define _LCDDATA7_S48C1_LENGTH                   0x00000001

#define _LCDDATA7_S49C1_POSITION                 0x00000001
#define _LCDDATA7_S49C1_MASK                     0x00000002
#define _LCDDATA7_S49C1_LENGTH                   0x00000001

#define _LCDDATA7_S50C1_POSITION                 0x00000002
#define _LCDDATA7_S50C1_MASK                     0x00000004
#define _LCDDATA7_S50C1_LENGTH                   0x00000001

#define _LCDDATA7_S51C1_POSITION                 0x00000003
#define _LCDDATA7_S51C1_MASK                     0x00000008
#define _LCDDATA7_S51C1_LENGTH                   0x00000001

#define _LCDDATA7_S52C1_POSITION                 0x00000004
#define _LCDDATA7_S52C1_MASK                     0x00000010
#define _LCDDATA7_S52C1_LENGTH                   0x00000001

#define _LCDDATA7_S53C1_POSITION                 0x00000005
#define _LCDDATA7_S53C1_MASK                     0x00000020
#define _LCDDATA7_S53C1_LENGTH                   0x00000001

#define _LCDDATA7_S54C1_POSITION                 0x00000006
#define _LCDDATA7_S54C1_MASK                     0x00000040
#define _LCDDATA7_S54C1_LENGTH                   0x00000001

#define _LCDDATA7_S55C1_POSITION                 0x00000007
#define _LCDDATA7_S55C1_MASK                     0x00000080
#define _LCDDATA7_S55C1_LENGTH                   0x00000001

